Revit 2027 API
PlanarFace.XVector Property
The X-vector of the planar face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ XVector { get; }
Public ReadOnly Property XVector As XYZ
	Get
public:
property XYZ^ XVector {
	XYZ^ get ();
}
member XVector : XYZ with get
Property Value
XYZ
Remarks
Note that the cross product of X-vector and Y-vector may result in the reverse of the FaceNormal vector depending upon how Revit has structured this particular face.
See Also
Reference
PlanarFace Class
Autodesk.Revit.DB Namespace